<?php 

//十神  0 十神描述 1 名的影响 2型号
$nature_name['正官']= array('从您提供的资料来看，孩子的八字十神为<span>正官</span>，为人厚道、品性端正、办事认真，讲信用、重视名誉，未来可往<span>领导型</span>人才的方向培养，工作稳重踏实、管理能力极强、为人廉洁公正、处处受人尊敬，但有时会表现得过于清高自信、固执刻板、缺乏创新和应变能力。','从八字命格阴阳气运来看，X字（XX两字）可帮助孩子弥补命盘的不足，使命格更趋完美，让孩子未来成长之路更快乐、健康，一生命运更为顺遂。 ','领导型');
$nature_name['偏官']= array('从您提供的资料来看，孩子的八字十神为<span>偏官</span>，果断热情、头脑灵活、善谋略，有随机应变的本能，未来可往<span>领导型</span>人才的方向培养，做事十分有魄力。但有时会表现得较为霸道偏激，让人有不敢去亲近之感觉，所以交际能力及手腕谈不上灵活，带人欠缺圆通。','从八字命格阴阳气运来看，X字（XX两字）可帮助孩子弥补命盘的不足，使命格更趋完美，让孩子未来成长之路更快乐、健康，一生命运更为顺遂。 ','领导型');
$nature_name['正印']= array('从您提供的资料来看，孩子的八字十神为<span>正印</span>，其人重情重义、聪颖仁慈、思考力丰富，善于研究、分析，未来可往<span>谋略型</span>人才的方向培养。但有时爱耍聪明，个性上也有些淡泊名利、逆来顺受，进取心不强，很容易浪费了本身的聪明才智、限制人生格局，错过人生良机。','从八字命格阴阳气运来看，X字（XX两字）可帮助孩子弥补命盘的不足，使命格更趋完美，让孩子未来成长之路更快乐、健康，一生命运更为顺遂。 ','谋略型');
$nature_name['偏印']= array('从您提供的资料来看，孩子的八字十神为<span>偏印</span>，反应机敏、多才多艺，性格内向多疑、多疑则多思，因此善于研究、分析，未来可往<span>谋略型</span>人才的方向培养。但偏印的人不善于用语言去与人处事，在交际能力方面，不会用手腕，往往舌利如刀，所以给人印象不好，甚至对人一片好心，反而让人以为恶意。','从八字命格阴阳气运来看，X字（XX两字）可帮助孩子弥补命盘的不足，使命格更趋完美，让孩子未来成长之路更快乐、健康，一生命运更为顺遂。 ','谋略型');
$nature_name['正财']= array('从您提供的资料来看，孩子的八字十神为<span>正财</span>，一生财运较好，富态安祥，清闲自在。为人勤劳节俭、待人诚恳，做事踏实，未来可往<span>技术型</span>人才的方向培养，靠自身技艺兴业。但正财的人易缺乏进取心、得过且过，有时会显得懦弱无能，容易庸庸碌碌过一生。','从八字命格阴阳气运来看，X字（XX两字）可帮助孩子弥补命盘的不足，使命格更趋完美，让孩子未来成长之路更快乐、健康，一生命运更为顺遂。 ','技术型');
$nature_name['偏财']= array('从您提供的资料来看，孩子的八字十神为<span>偏财</span>，为人豪爽、善于交际、人缘颇佳，头脑灵活、聪明机敏，未来可往<span>开创型</span>人才的方向培养，能够依靠自己的创造力与良好的人脉建立一番自己的事业。但也小心因贪图虚荣、缺少恒心、喜新厌旧、多学少精等缺点，而阻碍个人发展。','从八字命格阴阳气运来看，X字（XX两字）可帮助孩子弥补命盘的不足，使命格更趋完美，让孩子未来成长之路更快乐、健康，一生命运更为顺遂。 ','开创型');
$nature_name['比肩']= array('从您提供的资料来看，孩子的八字十神为<span>比肩</span>，为人自尊心强、喜争强好胜、施展权威，但能关心下属，受朋友的拥护敬佩，未来可往<span>领导型</span>人才的方向培养。但由于不会圆滑与通融，交际能力较弱，有时甚至给人独断专行的印象，且容易眼高手低、虚荣心重。','从八字命格阴阳气运来看，X字（XX两字）可帮助孩子弥补命盘的不足，使命格更趋完美，让孩子未来成长之路更快乐、健康，一生命运更为顺遂。 ','领导型');
$nature_name['劫财']= array('从您提供的资料来看，孩子的八字十神为<span>劫财</span>，骄傲自信、独行独断、争强好斗，但热情坦率、志向高远、富有斗争精神，未来可往<span>开创型</span>人才的方向培养，但有时会显得顽固不通、自以为是、固执莽进，给人有勇无谋的印象。也因为行动性急，容易到处树敌，从而阻碍发展。','从八字命格阴阳气运来看，X字（XX两字）可帮助孩子弥补命盘的不足，使命格更趋完美，让孩子未来成长之路更快乐、健康，一生命运更为顺遂。 ','开创型');
$nature_name['食神']= array('从您提供的资料来看，孩子的八字十神为<span>食神</span>，为人宽宏大量、性情温和、君子风度、给人的感觉亲近可敬，人缘极佳，加上艺术感强，未来可往<span>技术型</span>人才的方向培养，靠自身技艺兴业，但由于老实懦弱、贪图享受，人生格局会较小，需要不断自我突破。','从八字命格阴阳气运来看，X字（XX两字）可帮助孩子弥补命盘的不足，使命格更趋完美，让孩子未来成长之路更快乐、健康，一生命运更为顺遂。 ','技术型');
$nature_name['伤官']= array('从您提供的资料来看，孩子的八字十神为<span>伤官</span>，为人头脑聪明、志向高远、才华横溢、富有创新精神，且能够吃苦耐劳，但性喜自由、爱好争斗、不适宜被拘束，未来可往<span>开创型</span>人才的方向培养，闯出自己的一番事业。由于常自命不凡，喜欢自我表现、高调行事，易招人小人拦路。','从八字命格阴阳气运来看，X字（XX两字）可帮助孩子弥补命盘的不足，使命格更趋完美，让孩子未来成长之路更快乐、健康，一生命运更为顺遂。 ','开创型');




//生肖宜忌  0 生肖宜 1 生肖忌
$zodiac_word = array(
	array('子','鼠','宝宝生肖属鼠，起名用字宜含有部首为宀、米、豆、鱼、艹、金、玉（王）、人（亻、彳）、木、月、田的字，可增强宝宝气运。'),
	array('丑','牛','宝宝生肖属牛，起名用字宜含有部首为水（氵、冫）、艹、豆、米、金、玉（王）、宀、人（亻、彳）、木的字，可增强宝宝气运。'),
	array('寅','虎','宝宝生肖属虎，起名用字宜含有部首为山、玉（王）、金、木、示（礻）、水（氵、冫）、月、犭、马的字，可增强宝宝气运。'),
	array('卯','兔','宝宝生肖属兔，起名用字宜含有部首为月、艹、山、田、人（亻、彳）、禾、木、宀、金、白、玉（王）、豆的字，可增强宝宝气运。'),
	array('辰','龙','宝宝生肖属龙，起名用字宜含有部首为水（氵、冫）、金、玉（王）、白、赤、月、鱼、酉、人（亻、彳）的字，可增强宝宝气运。'),
	array('巳','蛇','宝宝生肖属蛇，起名用字宜含有部首为艹、虫、豆、鱼、酉、木、田、山、金、玉（王）、月、土、禾、宀、马、羊、牛、羽、辶（走）、廴、几（儿）的字，可增强宝宝气运。'),
	array('午','马','宝宝生肖属马，起名用字宜含有部首为艹、金、玉（王）、木、禾、虫、米、人（亻、彳）、月、土、扌的字，可增强宝宝气运。'),
	array('未','羊','宝宝生肖属羊，起名用字宜含有部首为金、白、玉（王）、月、田、豆、米、马、禾、木、人（亻、彳）、艹、鱼的字，可增强宝宝气运。'),
	array('申','猴','宝宝生肖属猴，起名用字宜含有部首为木、禾、金、玉（王）、豆、米、田、山、月、水（氵、冫）、人（亻、彳）的字，可增强宝宝气运。'),
	array('酉','鸡','宝宝生肖属鸡，起名用字宜含有部首为米、豆、虫、木、禾、玉（王）、月、宀、山、艹、金的字，可增强宝宝气运。'),
	array('戌','狗','宝宝生肖属狗，起名用字宜含有部首为鱼、豆、米、宀、马、金、玉（王）、艹、田、木、月、禾、水（氵、冫）、人（亻、彳）的字，可增强宝宝气运。'),
	array('亥','猪','宝宝生肖属猪，起名用字宜含有部首为豆、米、鱼、水（氵、冫）、金、玉（王）、月、木、人（亻、彳）、山、土、艹的字，可增强宝宝气运。'),

);

$zodiac_score = array(
	'鼠'=>array('宀','米','豆','鱼','艹','金','玉','王','人','亻','彳','木','月','田'),
	'牛'=>array('水','氵','冫','艹','豆','米','金','玉','王','宀','人','亻','彳','木'),
	'虎'=>array('山','玉','王','金','木','示','礻','水','氵','冫','月','犭','马'),
	'兔'=>array('月','艹','山','田','人','亻','彳','禾','木','宀','金','白','玉','王','豆'),
	'龙'=>array('水','氵','冫','金','玉','王','白','赤','月','鱼','酉','人','亻','彳'),
	'蛇'=>array('艹','虫','豆','鱼','酉','木','田','山','金','玉','王','月','','土','禾','宀','马','羊','牛','羽','辶','走v廴','几','儿'),
	'马'=>array('艹','金','玉','王','木','禾','虫','米','人','亻','彳','月','土','扌'),
	'羊'=>array('金','白','玉','王','月','田','豆','米','马','禾','木','人','亻','彳','、艹','鱼'),
	'猴'=>array('木','禾','金','玉','王','豆','米','田','山','月','水','氵','冫','人','亻','彳'),
	'鸡'=>array('米','豆','虫','木','禾','玉','王','月','宀','山','艹','金'),
	'狗'=>array('鱼','豆','米','宀','马','金','玉','王','艹','田','木','月','禾','水','氵','冫','人','亻','彳'),
	'猪'=>array('豆','米','鱼','水','氵','冫','金','玉','王','月','木','人','亻','彳','山','土','艹'),

);


//五行打分 0 五行关系  1 得分
$wx_score_arr =array(

		array(['相合','相合相合'],80),
		array(['相生','相生相生'],75),
		array(['相安','相安相安'],65),
		array(['相泄','相泄相泄'],55),
		array(['相克','相克相克'],45),


		array(['相合相生','相生相合'],78),
		array(['相合相泄','相泄相合'],70),
		array(['相合相安','相安相合'],72),
		array(['相合相克','相克相合'],68),
		array(['相生相泄','相泄相生'],60),
		array(['相生相安','相安相生'],62),
		array(['相生相克','相克相生'],58),
		array(['相泄相安','相安相泄'],52),
		array(['相泄相克','相克相泄'],48),
		array(['相安相克','相克相安'],50),


);



//八字十神单字  0 阴阳属性 1 得分
$ten_god_property['技术型']=array('阳性','10');
$ten_god_property['谋略型']=array('阳性','10');
$ten_god_property['领导型']=array('阴性','10');
$ten_god_property['开创型']=array('阴性','10');


//八字十神双字首要 0 命格型号 1 第一个字的属性 2 第二个字的属性 3得分
$double_tengod[0]=array('技术型','阳性','阳性','10');
$double_tengod[1]=array('谋略型','中性','阳性','10');
$double_tengod[2]=array('谋略型','阳性','中性','10');
$double_tengod[3]=array('领导型','中性','阴性','10');
$double_tengod[4]=array('领导型','阴性','中性','10');
$double_tengod[5]=array('开创型','阴性','阴性','10');

//八字十神双字次要 0 命格型号 1 第一个字的属性 2 第二个字的属性 3得分
$double_tengod[6]=array('技术型','阳性','中性','5');
$double_tengod[7]=array('技术型','中性','阳性','5');
$double_tengod[8]=array('开创型','阴性','中性','5');
$double_tengod[9]=array('开创型','中性','阴性','5');



//音韵得分
$voice_score_arr = array(
	//单字名  0 姓  1 名  2 得分
	'single'=>array(
		array('阴平','阴平','2.5'),
		array('阴平','阳平','2.5'),
		array('阴平','上声','2.5'),
		array('阳平','阴平','2.5'),
		array('阳平','上声','2.5'),
		array('阳平','去声','2.5'),
		array('上声','阴平','2.5'),
		array('上声','阳平','2.5'),
		array('上声','去声','2.5'),
		array('去声','阴平','2.5'),
		array('去声','阳平','2.5'),
		array('去声','上声','2.5'),
		array('阴平','去声','1.5'),
		array('阳平','阳平','1.5'),
		array('上声','上声','0.5'),
		array('去声','去声','0.5'),

	),
	//双字名  0 姓  1 第一个字  2 第二个字  3 得分
	'double'=>array(
		array('阴平','阳平','阴平','2.5'),
		array('阴平','上声','上声','2.5'),
		array('阴平','去声','阳平','2.5'),
		array('阴平','阳平','去声','2.5'),
		array('阴平','上声','阳平','2.5'),
		array('阴平','去声','阳平','2.5'),
		array('阴平','上声','阴平','2.5'),
		array('阴平','阴平','阳平','1.5'),
		array('阴平','阴平','上声','1.5'),
		array('阴平','阴平','去声','1.5'),
		array('阴平','阳平','阳平','1.5'),
		array('阴平','阳平','上声','1.5'),
		array('阴平','上声','去声','1.5'),
		array('阴平','阴平','阴平','0.5'),
		array('阴平','去声','上声','0.5'),
		array('阴平','去声','去声','0.5'),

		array('阳平','阴平','阳平','2.5'),
		array('阳平','阴平','上声','2.5'),
		array('阳平','阴平','去声','2.5'),
		array('阳平','上声','阴平','2.5'),
		array('阳平','上声','阳平','2.5'),
		array('阳平','去声','阴平','2.5'),
		array('阳平','去声','阳平','2.5'),
		array('阳平','去声','上声','2.5'),
		array('阳平','阴平','阳平','1.5'),
		array('阳平','阳平','上声','1.5'),
		array('阳平','阳平','去声','1.5'),
		array('阳平','阴平','阴平','1.5'),
		array('阳平','上声','上声','1.5'),
		array('阳平','上声','去声','1.5'),
		array('阳平','去声','去声','0.5'),
		array('阳平','阳平','阳平','0.5'),

		array('上声','阴平','阴平','2.5'),
		array('上声','阴平','阳平','2.5'),
		array('上声','阴平','上声','2.5'),
		array('上声','阴平','去声','2.5'),
		array('上声','阳平','阴平','2.5'),
		array('上声','阳平','去声','2.5'),
		array('上声','去声','阴平','2.5'),
		array('上声','去声','阳平','2.5'),
		array('上声','去声','上声','2.5'),
		array('上声','阳平','阳平','1.5'),
		array('上声','阳平','上声','1.5'),
		array('上声','上声','阴平','0.5'),
		array('上声','上声','阳平','0.5'),
		array('上声','上声','上声','0.5'),
		array('上声','上声','去声','0.5'),
		array('上声','去声','去声','0.5'),

		array('去声','阴平','阴平','2.5'),
		array('去声','阴平','阳平','2.5'),
		array('去声','阴平','上声','2.5'),
		array('去声','阴平','去声','2.5'),
		array('去声','阳平','阴平','2.5'),
		array('去声','阳平','上声','2.5'),
		array('去声','阳平','去声','2.5'),
		array('去声','上声','阴平','2.5'),
		array('去声','上声','阳平','2.5'),
		array('去声','上声','去声','2.5'),
		array('去声','去声','阴平','0.5'),
		array('去声','去声','阳平','0.5'),
		array('去声','去声','上声','0.5'),
		array('去声','去声','去声','0.5'),
		array('去声','阳平','阳平','0.5'),
		array('去声','上声','上声','0.5'),

	)
);

//结构得分
$structure_score_arr = array(
	//单字名 0 姓  1 名  2 得分
	'single'=>array(
		array('独体字','独体字','1.5'),
		array('独体字','上下结构','2'),
		array('独体字','左右结构','2.5'),
		array('独体字','全包围结构','2'),
		array('独体字','半包围结构','2.5'),
		array('上下结构','独体字','2'),
		array('上下结构','上下结构','1.5'),
		array('上下结构','左右结构','2.5'),
		array('上下结构','全包围结构','2'),
		array('上下结构','半包围结构','2.5'),
		array('左右结构','独体字','2'),
		array('左右结构','上下结构','2.5'),
		array('左右结构','左右结构','2.5'),
		array('左右结构','全包围结构','2.5'),
		array('左右结构','半包围结构','2.5'),
		array('全包围结构','独体字','1.5'),
		array('全包围结构','上下结构','2'),
		array('全包围结构','左右结构','2.5'),
		array('全包围结构','全包围结构','1.5'),
		array('全包围结构','半包围结构','2'),
		array('半包围结构','独体字','2'),
		array('半包围结构','上下结构','1.5'),
		array('半包围结构','左右结构','2.5'),
		array('半包围结构','全包围结构','2'),
		array('半包围结构','半包围结构','1.5'),
	),
	//双字名 0 姓  1.第一字  2 第二字  3 得分
	'double'=>array(
		array('独体字','独体字','独体字','1'),
		array('独体字','独体字','上下结构','1.5'),
		array('独体字','独体字','左右结构','2'),
		array('独体字','独体字','全包围结构','1.5'),
		array('独体字','独体字','半包围结构','2'),
		array('上下结构','独体字','独体字','1.5'),
		array('上下结构','独体字','上下结构','1'),
		array('上下结构','独体字','左右结构','2.5'),
		array('上下结构','独体字','全包围结构','1'),
		array('上下结构','独体字','半包围结构','1.5'),
		array('左右结构','独体字','独体字','1'),
		array('左右结构','独体字','上下结构','2.5'),
		array('左右结构','独体字','左右结构','2.5'),
		array('左右结构','独体字','全包围结构','2'),
		array('左右结构','独体字','半包围结构','2.5'),
		array('全包围结构','独体字','独体字','1'),
		array('全包围结构','独体字','上下结构','1.5'),
		array('全包围结构','独体字','左右结构','2'),
		array('全包围结构','独体字','全包围结构','1.5'),
		array('全包围结构','独体字','半包围结构','1.5'),
		array('半包围结构','独体字','独体字','1.5'),
		array('半包围结构','独体字','上下结构','2'),
		array('半包围结构','独体字','左右结构','2.5'),
		array('半包围结构','独体字','全包围结构','1.5'),
		array('半包围结构','独体字','半包围结构','1'),

		array('独体字','上下结构','独体字','1'),
		array('独体字','上下结构','上下结构','1.5'),
		array('独体字','上下结构','左右结构','2'),
		array('独体字','上下结构','全包围结构','1.5'),
		array('独体字','上下结构','半包围结构','2'),
		array('上下结构','上下结构','独体字','1'),
		array('上下结构','上下结构','上下结构','1.5'),
		array('上下结构','上下结构','左右结构','2'),
		array('上下结构','上下结构','全包围结构','1.5'),
		array('上下结构','上下结构','半包围结构','1.5'),
		array('左右结构','上下结构','独体字','2'),
		array('左右结构','上下结构','上下结构','2'),
		array('左右结构','上下结构','左右结构','2.5'),
		array('左右结构','上下结构','全包围结构','2.5'),
		array('左右结构','上下结构','半包围结构','2.5'),
		array('全包围结构','上下结构','独体字','1.5'),
		array('全包围结构','上下结构','上下结构','1.5'),
		array('全包围结构','上下结构','左右结构','2'),
		array('全包围结构','上下结构','全包围结构','1.5'),
		array('全包围结构','上下结构','半包围结构','1.5'),
		array('半包围结构','上下结构','独体字','2'),
		array('半包围结构','上下结构','上下结构','1.5'),
		array('半包围结构','上下结构','左右结构','2.5'),
		array('半包围结构','上下结构','全包围结构','2'),
		array('半包围结构','上下结构','半包围结构','2'),

		array('独体字','左右结构','独体字','2'),
		array('独体字','左右结构','上下结构','2'),
		array('独体字','左右结构','左右结构','2.5'),
		array('独体字','左右结构','全包围结构','2'),
		array('独体字','左右结构','半包围结构','2'),
		array('上下结构','左右结构','独体字','2'),
		array('上下结构','左右结构','上下结构','2'),
		array('上下结构','左右结构','左右结构','2.5'),
		array('上下结构','左右结构','全包围结构','2.5'),
		array('上下结构','左右结构','半包围结构','2.5'),
		array('左右结构','左右结构','独体字','2.5'),
		array('左右结构','左右结构','上下结构','2.5'),
		array('左右结构','左右结构','左右结构','2'),
		array('左右结构','左右结构','全包围结构','2.5'),
		array('左右结构','左右结构','半包围结构','2.5'),
		array('全包围结构','左右结构','独体字','2'),
		array('全包围结构','左右结构','上下结构','2'),
		array('全包围结构','左右结构','左右结构','2.5'),
		array('全包围结构','左右结构','全包围结构','1.5'),
		array('全包围结构','左右结构','半包围结构','2'),
		array('半包围结构','左右结构','独体字','2'),
		array('半包围结构','左右结构','上下结构','2'),
		array('半包围结构','左右结构','左右结构','2.5'),
		array('半包围结构','左右结构','全包围结构','1'),
		array('半包围结构','左右结构','半包围结构','1'),

		array('独体字','全包围结构','独体字','1'),
		array('独体字','全包围结构','上下结构','1.5'),
		array('独体字','全包围结构','左右结构','2'),
		array('独体字','全包围结构','全包围结构','2.5'),
		array('独体字','全包围结构','半包围结构','2.5'),
		array('上下结构','全包围结构','独体字','2'),
		array('上下结构','全包围结构','上下结构','2'),
		array('上下结构','全包围结构','左右结构','2.5'),
		array('上下结构','全包围结构','全包围结构','1.5'),
		array('上下结构','全包围结构','半包围结构','1.5'),
		array('左右结构','全包围结构','独体字','2'),
		array('左右结构','全包围结构','上下结构','2.5'),
		array('左右结构','全包围结构','左右结构','2.5'),
		array('左右结构','全包围结构','全包围结构','1.5'),
		array('左右结构','全包围结构','半包围结构','2'),
		array('全包围结构','全包围结构','独体字','1.5'),
		array('全包围结构','全包围结构','上下结构','1.5'),
		array('全包围结构','全包围结构','左右结构','1.5'),
		array('全包围结构','全包围结构','全包围结构','1.5'),
		array('全包围结构','全包围结构','半包围结构','1.5'),
		array('半包围结构','全包围结构','独体字','1.5'),
		array('半包围结构','全包围结构','上下结构','1.5'),
		array('半包围结构','全包围结构','左右结构','1.5'),
		array('半包围结构','全包围结构','全包围结构','1.5'),
		array('半包围结构','全包围结构','半包围结构','1.5'),

		array('独体字','半包围结构','独体字','1'),
		array('独体字','半包围结构','上下结构','1.5'),
		array('独体字','半包围结构','左右结构','2'),
		array('独体字','半包围结构','全包围结构','1.5'),
		array('独体字','半包围结构','半包围结构','1.5'),
		array('上下结构','半包围结构','独体字','2'),
		array('上下结构','半包围结构','上下结构','2.5'),
		array('上下结构','半包围结构','左右结构','2.5'),
		array('上下结构','半包围结构','全包围结构','1.5'),
		array('上下结构','半包围结构','半包围结构','1.5'),
		array('左右结构','半包围结构','独体字','2.5'),
		array('左右结构','半包围结构','上下结构','2'),
		array('左右结构','半包围结构','左右结构','2'),
		array('左右结构','半包围结构','全包围结构','1.5'),
		array('左右结构','半包围结构','半包围结构','1.5'),
		array('全包围结构','半包围结构','独体字','1.5'),
		array('全包围结构','半包围结构','上下结构','1.5'),
		array('全包围结构','半包围结构','左右结构','1.5'),
		array('全包围结构','半包围结构','全包围结构','1.5'),
		array('全包围结构','半包围结构','半包围结构','1.5'),
		array('半包围结构','半包围结构','独体字','1.5'),
		array('半包围结构','半包围结构','上下结构','1.5'),
		array('半包围结构','半包围结构','左右结构','1.5'),
		array('半包围结构','半包围结构','全包围结构','1.5'),
		array('半包围结构','半包围结构','半包围结构','1.5'),

	)
);

